[
  {
    "id": 1,
    "title": "Getting Started Guide",
    "content": "# Getting Started\n\n---\n\nWelcome to our platform...\n\ntest edit #1\n\n## subtitle"
  },
  {
    "id": 2,
    "title": "API Documentation",
    "content": "# API Reference\n\n## Endpoints\n\n..."
  },
  {
    "id": 3,
    "title": "Operating a Water Pump",
    "content": "### Introduction\nOperating a water pump is a critical task in managing water infrastructure. This guide provides step-by-step instructions on how to safely and efficiently operate a water pump.\n\n**Safety Precautions**\n1. Wear Protective Gear: Always wear appropriate protective gear, including gloves, safety goggles, and ear protection.\n2. Check for Hazards: Ensure the area around the pump is clear of any hazards or obstructions.\n3. Read the Manual: Familiarize yourself with the pump's operation manual and safety guidelines.\n\n**Starting the Pump**\n1. Inspect the Pump: Check the pump for any visible damage or leaks. Ensure all connections are secure.\n2. Prime the Pump: If required, prime the pump by filling the pump casing with water to remove any air.\n3. Check Valves: Ensure that all valves are in the correct position for operation.\n4. Power On: Turn on the power supply to the pump. This may involve flipping a switch or pressing a start button.\n5. Monitor Pressure: Observe the pressure gauge to ensure the pump is building pressure correctly.\n\n**Operating the Pump**\n\n1. Adjust Flow Rate: Use the control valves to adjust the flow rate as needed for your application.\n2. Monitor Performance: Regularly check the pump's performance, including pressure, flow rate, and any unusual noises or vibrations.\n3. Record Data: Keep a log of the pump's operating parameters, including start time, pressure readings, and any maintenance performed.\n\n**Shutting Down the Pump**\n\n1. Reduce Flow: Gradually reduce the flow rate using the control valves.\n2. Power Off: Turn off the power supply to the pump.\n3. Close Valves: Close any valves to isolate the pump from the system.\n4. Inspect and Clean: Inspect the pump for any signs of wear or damage. Clean the pump and surrounding area as needed.\n\n**Maintenance**\n\n1. Regular Inspections: Perform regular inspections of the pump and its components to identify any potential issues.\n2. Lubrication: Ensure that all moving parts are properly lubricated according to the manufacturer's recommendations.\n3. Replace Worn Parts: Replace any worn or damaged parts promptly to prevent further damage to the pump.\n\n**Troubleshooting**\n\n- Low Pressure: Check for leaks, blockages, or air in the system. Ensure the pump is properly primed.\n- Noisy Operation: Inspect for loose components, cavitation, or worn bearings.\n- Overheating: Ensure adequate cooling and ventilation. Check for blockages in the cooling system.\n\n**Conclusion**\nProper operation and maintenance of a water pump are essential for ensuring reliable performance and longevity. Always follow the manufacturer's guidelines and safety procedures to operate the pump safely and efficiently."
  },
  {
    "id": 4,
    "title": "test title",
    "content": "## lol hej\n---\n123"
  }
]
